In [2]:
import pandas as pd

df1 = pd.read_csv("file1.csv")
df2 = pd.read_csv("file2.csv")

print(df1)
print(df2)

   id     name  age
0   1    Alice   25
1   2      Bob   30
2   3  Charlie   35
   id      city  salary
0   1  New York   70000
1   2    London   80000
2   4    Sydney   90000

##### pd.merge() â€“ SQL-style join (most common)

In [3]:
pd.merge(df1, df2, on="id")

   id   name  age      city  salary
0   1  Alice   25  New York   70000
1   2    Bob   30    London   80000

##### left join

In [ ]:
pd.merge(df1, df2, on="id", how="left")

   id     name  age      city   salary
0   1    Alice   25  New York  70000.0
1   2      Bob   30    London  80000.0
2   3  Charlie   35       NaN      NaN

##### right join

In [14]:
pd.merge(df1, df2, on="id", how="right")

   id   name   age      city  salary
0   1  Alice  25.0  New York   70000
1   2    Bob  30.0    London   80000
2   4    NaN   NaN    Sydney   90000

##### ðŸ”¹ Outer Join

In [ ]:
result = pd.merge(df1, df2, on="id", how="outer")
print(result)
# Use merge() when you have a common column/key

   id     name   age      city   salary
0   1    Alice  25.0  New York  70000.0
1   2      Bob  30.0    London  80000.0
2   3  Charlie  35.0       NaN      NaN
3   4      NaN   NaN    Sydney  90000.0